In [1]:
import pandas as pd
import numpy as nb
import seaborn as sns

In [2]:
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
# get the shape of the data
df.shape

(244, 7)

In [4]:
# view the top 10 row
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [5]:
# view the bottom 20 rows
df.tail(20)

     total_bill   tip     sex smoker   day    time  size
224       13.42  1.58    Male    Yes   Fri   Lunch     2
225       16.27  2.50  Female    Yes   Fri   Lunch     2
226       10.09  2.00  Female    Yes   Fri   Lunch     2
227       20.45  3.00    Male     No   Sat  Dinner     4
228       13.28  2.72    Male     No   Sat  Dinner     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
230       24.01  2.00    Male    Yes   Sat  Dinner     4
231       15.69  3.00    Male    Yes   Sat  Dinner     3
232       11.61  3.39    Male     No   Sat  Dinner     2
233       10.77  1.47    Male     No   Sat  Dinner     2
234       15.53  3.00    Male    Yes   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [18]:
# get the average total bill by only male
df[df['sex']=='Male'].mean()

total_bill    20.744076
tip            3.089618
size           2.630573
dtype: float64

In [9]:
# get the average (mean, median) total bill and tip given by smoker and non smoker
df.groupby('smoker')['total_bill', 'tip'].agg('mean', 'median')

        total_bill       tip
smoker
Yes      20.756344  3.008710
No       19.188278  2.991854

In [19]:
#Get the avg(mean,median) total_bill and tip given by smoker and non smoker
pd.pivot_table(data= df, values=['total_bill', 'tip'], index= ['smoker'], aggfunc= ['mean', 'median'])

            mean            median
             tip total_bill    tip total_bill
smoker
Yes     3.008710  20.756344   3.00      17.92
No      2.991854  19.188278   2.74      17.59

In [15]:
# what is most frequent time of visit
df.groupby('time')['time'].agg('count')

time
Lunch      68
Dinner    176
Name: time, dtype: int64

In [20]:
# Which day customers are giving more tips
df.groupby('day')['tip'].agg('mean')

day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64

In [23]:
#get the avg(median) tip and total_bill amount by smoker(yes) on sunday
pd.pivot_table(data=df, values=['tip', 'total_bill'], index=['smoker', 'day'], aggfunc=['median', 'mean'])

            median                 mean
               tip total_bill       tip total_bill
smoker day
Yes    Thur  2.560     16.470  3.030000  19.190588
       Fri   2.500     13.420  2.714000  16.813333
       Sat   2.690     20.390  2.875476  21.276667
       Sun   3.500     23.100  3.516842  24.120000
No     Thur  2.180     15.950  2.673778  17.113111
       Fri   3.125     19.235  2.812500  18.420000
       Sat   2.750     17.820  3.102889  19.661778
       Sun   3.020     18.430  3.167895  20.506667

In [24]:
#get the (mean,median,min,max) tip and total_bill amount by smoker(yes) on friday with time(Lunch)
#1 What is min bill by a smoker on sunday
#2 what is max tip by a non smoker on thursday
#3 what is total_bill made on sat by non smokers

pd.pivot_table(data=df, values=['tip', 'total_bill'], index=['smoker', 'day', 'time'], aggfunc=['median', 'mean', 'min', 'max'])

                   median                 mean              min             \
                      tip total_bill       tip total_bill   tip total_bill
smoker day  time
Yes    Thur Lunch   2.560     16.470  3.030000  19.190588  2.00      10.34
       Fri  Lunch   2.100     12.790  2.280000  12.323333  1.58       8.58
            Dinner  3.000     16.320  3.003333  19.806667  1.00       5.75
       Sat  Dinner  2.690     20.390  2.875476  21.276667  1.00       3.07
       Sun  Dinner  3.500     23.100  3.516842  24.120000  1.50       7.25
No     Thur Lunch   2.105     15.235  2.666364  17.075227  1.25       7.51
            Dinner  3.000     18.780  3.000000  18.780000  3.00      18.78
       Fri  Lunch   3.000     15.980  3.000000  15.980000  3.00      15.98
            Dinner  3.250     22.490  2.750000  19.233333  1.50      12.46
       Sat  Dinner  2.750     17.820  3.102889  19.661778  1.00       7.25
       Sun  Dinner  3.020     18.430  3.167895  20.506667  1.01       8.77

                      max
                      tip total_bill
smoker day  time
Yes    Thur Lunch    5.00      43.11
       Fri  Lunch    3.48      16.27
            Dinner   4.73      40.17
       Sat  Dinner  10.00      50.81
       Sun  Dinner   6.50      45.35
No     Thur Lunch    6.70      41.19
            Dinner   3.00      18.78
       Fri  Lunch    3.00      15.98
            Dinner   3.50      22.75
       Sat  Dinner   9.00      48.33
       Sun  Dinner   6.00      48.17

In [27]:
#which gender is having highest bill amount
df.groupby('sex')['total_bill'].agg('mean')

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [29]:
#create a new column total_bill amount category(low, moderate, high)
df['total_bill_class'] = df['total_bill'].apply(lambda x: 'low' if x< 15
                                       else('moderate' if 15<=x<35
                                       else'high'))

In [30]:
df.head()

   total_bill   tip     sex smoker  day    time  size total_bill_class
0       16.99  1.01  Female     No  Sun  Dinner     2         moderate
1       10.34  1.66    Male     No  Sun  Dinner     3              low
2       21.01  3.50    Male     No  Sun  Dinner     3         moderate
3       23.68  3.31    Male     No  Sun  Dinner     2         moderate
4       24.59  3.61  Female     No  Sun  Dinner     4         moderate